*  Senior Project 
** Decissions / Questions?
*** How Pure to be?
*** How am I going to execute this crap?
**** Strieght OCaml :thisone:
**** Convert to some other language?
Is this legit? or does it go against what I said to do?
***** JS
***** Clojure
***** C?
** Tokenizer
*** DONE Make Type checker not have catchall                         :DEBT:
*** TODO Don't mess up stuff while reading it in
CLOSED: [2015-09-12 Sat 22:13]
*** TODO [#B] Strip out comments
*** TODO [#C] Change how Functions look?                            :EXTRA:
*** Remove "Display" from everywhere                                   :DEBT: 
** Pratt Parser
*** DONE Lists Parse
CLOSED: [2015-09-04 Fri 07:22]
:PROPERTIES:
:Effort:
:END:
:LOGBOOK:
CLOCK: [2015-09-03 Thu 21:02]--[2015-09-03 Thu 21:27] =>  0:25
:END:
**** Make it turn into a real list :debt:
*** DONE Fix broken "If statements" (match many)
CLOSED: [2015-09-07 Mon 11:05]
**** Looks like it broke in adding lists?
*** DONE Function Run 
CLOSED: [2015-09-09 Wed 07:03]
***** DONE Parse them 
CLOSED: [2015-09-07 Mon 14:06]
***** TODO Parse Arguments
*** DONE Repeat
CLOSED: [2015-09-09 Wed 18:21]
*** DONE Lists
CLOSED: [2015-09-12 Sat 10:56]
*** DONE Function Define
CLOSED: [2015-09-12 Sat 19:53]
**** Recursive? Hopefully?
uhhh no
*** TODO Until                                                        :EXTRA:
*** TODO Make List a list                                             :DEBT:
** Eval (Requirements):
*** Meta
**** How to store state?
***** Map that's passed along
***** Monad? <- most likely
**** How to deal with stuff that doesn't type check :P
***** Polymorphic functions?
***** Just throw errors <- Most likely
*** DONE Be able to print primitives
CLOSED: [2015-09-07 Mon 14:56]
**** Float
**** String
**** List
*** DONE If statements
CLOSED: [2015-09-07 Mon 14:56]
*** DONE ==, <, <=, >= for floats
CLOSED: [2015-09-07 Mon 15:21]
*** DONE Boolean
CLOSED: [2015-09-07 Mon 15:24]
**** DONE Negate
CLOSED: [2015-09-07 Mon 15:52]
**** DONE And
CLOSED: [2015-09-07 Mon 15:52]
**** DONE Or
CLOSED: [2015-09-07 Mon 15:52]
*** DONE Repeat statements
CLOSED: [2015-09-09 Wed 18:20]
*** DONE Run functions
*** DONE Store in a variable
CLOSED: [2015-09-11 Fri 08:18]
:LOGBOOK:
CLOCK: [2015-09-10 Thu 20:54]--[2015-09-10 Thu 21:19] =>  0:25
CLOCK: [2015-09-10 Thu 20:24]--[2015-09-10 Thu 20:49] =>  0:25
:END:
HOW?
**** Create a scope that you can pass around?
***** Preferably one that thinks about functional scope 
*** TODO Define functions
**** Definition 
***** capture scope?                                              :maybe:
dynamic scope!
**** Evoke
***** DONE body is not executed
CLOSED: [2015-09-12 Sat 20:37]
***** bind variables to the right name when evoked
*** DONE Run Defined functions
CLOSED: [2015-09-12 Sat 20:37]
**** Global
*** DONE Equality for Lists
CLOSED: [2015-09-12 Sat 10:55]
*** DONE Equality for strings
CLOSED: [2015-09-12 Sat 10:55]
*** DONE Be able to parse and execute in 1 second

CLOSED: [2015-09-12 Sat 10:55]
*** TODO [#A] Input from the user????
*** TODO make lists actually usefull
**** Add std lib funcitons
*** TODO write tests for all of the below
:PROPERTIES:
:Effort:   hard
:END:
there's quite a few that are not implemented yet 3
*** TODO debug  mode                                                 :maybe:
** Tech Debt:
*** TODO [#A] make scope less crazy
*** TODO [#A] figure out weird crazy stuff
*** TODO nud to use is_more_tokens :DEBT:                              :DEBT: 
*** TODO Convert lbp/rbp to using Result
**** NOTE: this may require to store lbp/rbp in the monad.
which may be less cle
*** TODO don't use exceptions in eval, at all.
